app/views/menus/index.html.erb

SELECT "entrees".* FROM "entrees" INNER JOIN "entrees_menus" ON "entrees"."id" = "entrees_menus"."entree_id" WHERE "entrees_menus"."menu_id" = $1  [["menu_id", 1]]
---
        <h3>Entrees</h3>
        <% menu.entrees.each do |entree| %>

SELECT "desserts".* FROM "desserts" INNER JOIN "desserts_menus" ON "desserts"."id" = "desserts_menus"."dessert_id" WHERE "desserts_menus"."menu_id" = $1  [["menu_id", 1]]
---
        <h3>Desserts</h3>
        <% menu.desserts.each do |dessert| %>

SELECT "beverages".* FROM "beverages" INNER JOIN "beverages_menus" ON "beverages"."id" = "beverages_menus"."beverage_id" WHERE "beverages_menus"."menu_id" = $1  [["menu_id", 1]]
---
        <h3>Beverages</h3>
        <% menu.beverages.each do |beverage| %>