app/controllers/images_controller.rb

INSERT INTO "images" ("name", "image", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @image = Image.new(image_params)
    respond_to do |format|
      if @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @image = Image.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "images" SET "image" = $1, "updated_at" = $2 WHERE "images"."id" = $3  [["image", "http://placebear.com/300/200/"], ["updated_at", 2017-08-12 16:35:13 UTC], ["id", 5]]
---
  def update
    @image = Image.find(params[:id])
    respond_to do |format|
      if @image.update(image_params)

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 1]]
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy